---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.Dispose
source: html/3a9485bb-f64a-dc82-e67e-cc83166e4a32.htm
---
# Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.Dispose Method

Releases all resources used by the IFCLegacyStairOrRamp

## Syntax (C#)
```csharp
public void Dispose()
```